# VDelete

## Description
Procedure VDelete deletes the specified saved view.

```pascal
PROCEDURE VDelete(name : STRING);
```

```python
def vs.VDelete(name):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|Name of view to be deleted.|

## Examples
==== VectorScript ====
```pascal
VDelete('Detail A-A');
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* View @ Zoom